#include<stdio.h>
int t[3][4]={{1,2,3,4},{2,3,4,5},{3,4,5,6}};
int output(int p[][4])
{
  printf("%d",p[2][3]);
  return 0;
}
int main()
{
  int (*p)[4];
  p=t;//等价于p=t[0][0];`
  output(p);

  int (*ptr1)[4];//数组指针
  int *ptr2[4];//指针数组
}
/*一维：带&是行地址，不带是元素地址
二维：
a                             数组名，指向一维数组a[0]，即0行首地址 等价于&a[0][0]
a+i,&a[i]                     i行首地址                           等价于&a[i][0]
a[0],*(a+0),*a                0行0列元素地址                      等价于&a[0][0]
a[i],*(a+i)                   i行0列元素的地址                    等价于&a[i][0]
a[i]+j,*(a+i)+j,&a[i][j]      i行j列元素的地址                    等价于a[i][j]
*(a[i]+j),*(*(a+i)+j),a[i][j] i行j列元素的值


*/